In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LinearRegression
import yfinance as yf

Downloaded Metal Prices using the yfinance library to download historical price data for the metals.

In [2]:
metals = ['GC=F', 'HG=F', 'SI=F', 'CB=F', 'NICKEL=F', 'LTHM']
metal_data = yf.download(metals, start="2010-01-01", end="2024-01-01")['Adj Close']
metal_data.columns = ['Gold', 'Copper', 'Silver', 'Cobalt', 'Nickel', 'Lithium']
metal_data.head()

[*********************100%***********************]  6 of 6 completed

2 Failed downloads:
['NICKEL=F', 'LTHM']: YFTzMissingError('$%ticker%: possibly delisted; no timezone found')

,Gold,Copper,Silver,Cobalt,Nickel,Lithium
Date,,,,,,
2010-01-04 00:00:00+00:00,134.25,1117.699951,3.3880,NaN,NaN,17.440001
2010-01-05 00:00:00+00:00,134.00,1118.099976,3.3960,NaN,NaN,17.781000
2010-01-06 00:00:00+00:00,133.25,1135.900024,3.4775,NaN,NaN,18.163000
2010-01-07 00:00:00+00:00,133.00,1133.099976,3.4115,NaN,NaN,18.333000
2010-01-08 00:00:00+00:00,133.00,1138.199951,3.3880,NaN,NaN,18.458000

Downloaded electrical vehicles prices using the yfinance library to download historical price data for the cars.

In [12]:
ev_data = pd.read_csv('Data/IEA-EV-dataEV salesHistoricalCars.csv') #parse_dates=['Date'], index_col='Date')
ev_data.head()

,region,category,parameter,mode,powertrain,year,unit,value,https://www.iea.org/data-and-statistics/data-tools/global-ev-data-explorer
0,Australia,Historical,EV sales share,Cars,EV,2011.0,percent,0.00650,NaN
1,Australia,Historical,EV stock share,Cars,EV,2011.0,percent,0.00039,NaN
2,Australia,Historical,EV sales,Cars,BEV,2011.0,Vehicles,49.00000,NaN
3,Australia,Historical,EV stock,Cars,BEV,2011.0,Vehicles,49.00000,NaN
4,Australia,Historical,EV stock,Cars,BEV,2012.0,Vehicles,220.00000,NaN

In [5]:
data = metal_data.join(ev_data).dropna()
data.head()

Empty DataFrame
Columns: [Gold, Copper, Silver, Cobalt, Nickel, Lithium, region, category, parameter, mode, powertrain, year, unit, value,  https://www.iea.org/data-and-statistics/data-tools/global-ev-data-explorer]
Index: []

In [11]:
ev_data2 = pd.read_csv('Data/IEA-EV-dataEV salesCarsHistorical.csv') 
ev_data2.head()

      region    category parameter  mode powertrain  year      unit  value
0  Australia  Historical  EV sales  Cars        BEV  2011  Vehicles     49
1  Australia  Historical  EV sales  Cars        BEV  2012  Vehicles    170
2  Australia  Historical  EV sales  Cars       PHEV  2012  Vehicles     80
3  Australia  Historical  EV sales  Cars       PHEV  2013  Vehicles    100
4  Australia  Historical  EV sales  Cars        BEV  2013  Vehicles    190

In [14]:
grouped_data_region = ev_data2.groupby(['region', 'year'])['value'].sum().reset_index()
grouped_data_region

        region  year     value
0    Australia  2011        49
1    Australia  2012       250
2    Australia  2013       290
3    Australia  2014      1320
4    Australia  2015      1760
..         ...   ...       ...
439      World  2018   2050000
440      World  2019   2080000
441      World  2020   2970000
442      World  2021   6500000
443      World  2022  10200000

[444 rows x 3 columns]

In [15]:
grouped_data_year = ev_data2.groupby(['year'])['value'].sum().reset_index()
grouped_data_year

    year     value
0   2010     18574
1   2011    114463
2   2012    283006
3   2013    510321
4   2014    810547
5   2015   1411417
6   2016   1835620
7   2017   2815219
8   2018   4693645
9   2019   5148213
10  2020   8359524
11  2021  17036811
12  2022  24862183